taurus/jmeter.yml
# ~/.bzt-rc file for Online Reporting
execution:
- concurrency: 10
  hold-for: 30s
  ramp-up: 5s
  scenario: Thread Group

scenarios:
  Thread Group:
    requests:
    - label: home
      method: GET
      url: http://127.0.0.1:5000/
    - label: hello
      method: GET
      url: http://127.0.0.1:5000/hello

reporting:
- module: final-stats
  summary: true
  percentiles: true
  failed-labels: false
  test-duration: true
  dump-csv: perf_result_csv.csv
- module: console
- module: blazemeter
  report-name: Taurus test report
  test: Taurus test
  project: Taurus test project
#- module: passfail
#  criteria:
#  - class: bzt.modules.monitoring.MonitoringCriteria
#    subject: local/cpu
#    condition: '>'
#    threshold: 50
#    timeframe: 5s